<?php
defined('BASEPATH') OR exit('No direct script access allowed');

?>
<style>
    h2{
        text-align: center;
    }
</style>

<div id="pagetitle">
    <img src="<?= config_item('resource_root') ?>image/283.png" alt="">
    <h1>プライバシーポリシー</h1>
    <p>Privacy Policy</p>
</div>

<main>
    <h2>ようこそ</h2>
    <p style="font-size: 23px">
        ようこそ、ShinyColorsPortalへ。
    </p>
    <p>
        このプライバシーポリシーは、皆さんに当サイトをお使いいただく上での我々の個人情報の取り扱いに関する方針をまとめたものです。
        当サイトをお使いいただくすべての方に同意いただく必要があります。皆様のご理解ご協力に深く感謝いたします。
    </p>
    <h2>適用する範囲</h2>
    <p>
        本ポリシーは ShinyColorsPortal(283pro.net) 内においてのみ適用します。
    </p>
    <hr>
    <h2>収集する情報</h2>
    <h3>自動的に取得する情報</h3>
    <p>
        ウェブブラウザの仕組み上、当サイトにアクセスする際に一定の情報をサーバで自動的に受け取ります。
        これには使用している端末の種類、ブラウザの種類およびバージョン、IPアドレス、直前に見ていたサイトなどが含まれます。
    </p>
    <p>
        我々はできる限りこの情報を利用しないように努めます。
        しかし、外部からの攻撃等により利用者及び我々を保護するために必要となった場合、これらのデータを第三者に開示することがあります。
    </p>
    <h3>アクセス解析</h3>
    <p>
        当サイトはGoogle Analyticsを利用しアクセス情報を収集します。これらのデータは匿名で収集されており、我々も個人を特定することはできません。
    </p>
    <p>
        Google Analyticsはアクセス情報の収集のためにCookieを使用します。皆さんはブラウザの設定を変更することでこれを拒否することができます。
        詳しくはお使いのブラウザのヘルプをご覧ください。また、このCookieは最長で26ヶ月の間保持されます。
    </p>
    <p>
        Google Analytics の利用規約は <a href="https://www.google.com/analytics/terms/jp.html" target="_blank">こちら</a> から確認できます。
    </p>
    <p>
        我々はアクセス解析で得られたデータを用いて、皆さんにより良いサービスを提供するための資料として活用します。
    </p>
    <h3>twista ユーザー情報</h3>
    <p>
        当サイトは<a href="<?= hsc(config_item('twista_url')) ?>" target="_blank">twista</a>のアカウントを利用したマイページ機能を提供しています。
    </p>
    <p>
        ログインされる際、当サイトはtwistaのAPIを経由してあなたの名前、アイコンのURLなどの情報を取得します。
        これらの情報は利用者の識別によりサービスを適切に運用するために利用します。
    </p>
    <hr>
    <h2>情報の共有</h2>
    <p>
        我々は以下の状況において、収集した情報を第三者に共有することがあります。
    </p>
    <h3>あなたの同意がある場合</h3>
    <p>
        あなたが情報の共有に同意した場合に、特定の用途のために共有する場合があります。<br>
        この場合、我々はあなたに対し、利用目的等について十分な説明をするように努めます。
    </p>
    <h3>法的な理由がある場合</h3>
    <p>
        法的な令状ないし開示請求があった場合に、利用者の情報を開示する場合があります。
    </p>
    <h3>統計データとして処理されている場合</h3>
    <p>
        匿名データの集合を統計的に処理した場合、これをサービスの改善のための参考資料としたり、広報を目的として公開することがあります。
    </p>
    <h3>あなたを含む利用者と我々を守るために必要となった場合</h3>
    <p>
        他の利用者に対する攻撃、あるいはシステムが攻撃を受けている場合など、他の利用者を保護する必要が生じた場合に管理者が合理的であると判断する範囲において利用者の情報を共有することがあります。
        しかしながら、我々はこのようなことが起きないことを望みますし、もし起きた場合も開示する情報が必要最小限度となるよう努めます。
    </p>
    <hr>
    <h2>重要な情報</h2>
    <h3>本ポリシーの更新</h3>
    <p>
        今後のサービスの拡大、あるいは法律の改正などにより、本ポリシーを更新する必要が生じた場合はこれを改訂することがあります。
    </p>
    <h3>改訂履歴</h3>
    <ul>
        <li>2019-05/14 - twistaアカウントに関する記述を追加</li>
        <li>2019-01/28 - 制定</li>
    </ul>
</main>
